# 1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

a = int(input('Введите номер дня недели от 1 до 7: '))

if a < 6: 
    print(a, '-> нет')
elif 8 > a > 5:
    print(a, '-> да')
else:
    print(a, '-> нет такого дня недели')

# 1.Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
X = int(input('Введите значение X: '))
Y = int(input('Введите значение Z: '))
Z = int(input('Введите значение Z: '))

print(not(X or Y or Z) == (not X and not Y and not Z))

# 2.Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

x = int(input('Введите значение координаты X: '))
y = int(input('Введите значение координаты Y: '))
if x==0 and y==0:
    print(f'x = {x}; y = {y};  -> начало координат')
if x>0 and y>0:
    print(f'x = {x}; y = {y};  -> 1 четверть')
if x<0 and y>0:
    print(f'x = {x}; y = {y};  -> 2 четверть')
if x<0 and y<0:
    print(f'x = {x}; y = {y};  -> 3 четверть')
if x>0 and y<0:
    print(f'x = {x}; y = {y};  -> 4 четверть')
if x==0 and y!=0:
    print(f'x = {x}; y = {y};  -> точка на оси Х')
if x!=0 and y==0:
    print(f'x = {x}; y = {y};  -> точка на оси Y')

# 2
# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).
a = int(input('Введите номер четверти: '))
if a==1:
     print('диапазон координат: x > 0; y > 0')
if a==2:
     print('диапазон координат: x < 0; y > 0')
if a==3:
     print('диапазон координат: x < 0; y < 0')
if a==4:
     print('диапазон координат: x > 0; y < 0')

# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
x1 = int(input('Введите значение координаты X1 точки А: '))
y1 = int(input('Введите значение координаты Y1 точки А: '))
x2 = int(input('Введите значение координаты X2 точки В: '))
y2 = int(input('Введите значение координаты Y2 точки В: '))
d = round(((x2-x1)**2 + (y2-y1)**2)**0.5, 2)
print(f'A {x1, y1}; B {x2, y2} -> {d}')
