# Вычислить число c заданной точностью d
# n = float(input('введите число '))
# f = str(input('задайте точность d '))
# m = 0
# for i in f:
#     if f[i] != '.':
#         m += 1
# m -= 1
# n = n * m * 10 // 1 / m * 10
# print(n)

# Пример:

# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$
# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# list = [7, 5, 3, 2]
# n = int(input('введите число '))
# a = n
# list1= []
# while n!=1:
# 	for i in list:
# 		if n%i==0:
# 			list1.append(i)
# 			n/=i
# if list1[1]>0:
#     print(list1)
# else:
#     print(n + ' - не имеет простых множителей')

# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
# list = list(int(input('Задайте последовательность чисел ').split()))
list = [2, 3, 4, 5, 6]
list1 = []
count = 0
for i in range(0, len(list)):
    for j in range(0, len(list)):
        if list[i] == list[j]:
            count += 1
    if count <= 1:
        list1.append(list[i])
print(list1)
        
# Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100) многочлена и записать в файл многочлен степени k.
# 
# Пример:

# - k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0
# Даны два файла, в каждом из которых находится запись многочлена. Задача - сформировать файл, содержащий сумму многочленов.